"""
Задача: Написать программу,
которая выводит указанное количество 
строк с фразой "Купи слона!".

"""

# Читаем количество строк
number = int(input())

# Выводим фразу "Купи слона!" number раз, каждая на новой строке
print("Купи слона!\n" * number)